install.packages(c("WikidataQueryServiceR", "tidyverse", "jsonlite"))
library(WikidataQueryServiceR)
library(tidyverse)
SELECT ?filmLabel ?actorLabel ?characterLabel WHERE {
library(WikidataQueryServiceR)
library(tidyverse)
SELECT ?filmLabel ?actorLabel ?characterLabel WHERE {
query <- '
SELECT ?filmLabel ?actorLabel ?characterLabel WHERE {
?film wdt:P57 wd:Q3772.  # Wes Anderson as director
?film wdt:P161 ?actor.   # Actor in film
OPTIONAL { ?film p:P161 ?castStatement.
?castStatement ps:P161 ?actor;
pq:P453 ?character. }
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
query
results <- query_wikidata(query)
results
query <- '
SELECT ?filmLabel ?actorLabel ?characterLabel WHERE {
?film wdt:P57 wd:Q3772.  # Wes Anderson as director
?film wdt:P161 ?actor.   # Actor in film
OPTIONAL { ?film p:P161 ?castStatement.
?castStatement ps:P161 ?actor;
pq:P453 ?character. }
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
results <- query_wikidata(query)
results
query <- '
SELECT ?filmLabel ?actorLabel ?characterLabel WHERE {
?film wdt:P57 wd:Q223687.  # Wes Anderson as director
?film wdt:P161 ?actor.   # Actor in film
OPTIONAL { ?film p:P161 ?castStatement.
?castStatement ps:P161 ?actor;
pq:P453 ?character. }
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
results
View(results)
results <- query_wikidata(query) |>
mutate(actorLabel = case_when(actorLabel == "Q1333118" ~ "Richard Ayoade"))
View(results)
results <- query_wikidata(query) |>
mutate(actorLabel = case_when(actorLabel == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actorLabel))
results
query <- '
SELECT ?filmLabel ?actorLabel ?duration WHERE {
?film wdt:P57 wd:Q223687.  # Wes Anderson as director
?film wdt:P161 ?actor.   # Actor in film
OPTIONAL { ?film p:P161 ?castStatement.
?castStatement ps:P161 ?actor;
pq:P453 ?character. }
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
results
query <- '
SELECT ?filmLabel ?actorLabel ?duration WHERE {
?film wdt:P57 wd:Q223687.  # Wes Anderson as director
?film wdt:P161 ?actor.   # Actor in film
?film wdt: PP2047. #film duration
OPTIONAL { ?film p:P161 ?castStatement.
?castStatement ps:P161 ?actor;
pq:P453 ?character. }
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
query <- '
SELECT ?filmLabel ?actorLabel ?duration WHERE {
?film wdt:P57 wd:Q223687.  # Wes Anderson as director
?film wdt:P161 ?actor.   # Actor in film
?film wdt: PP2047. #film duration
OPTIONAL { ?film p:P161 ?castStatement.
?castStatement ps:P161 ?actor;
pq:P453 ?character. }
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
query <- '
SELECT ?filmLabel ?actorLabel ?duration WHERE {
?film wdt:P57 wd:Q223687.  # Wes Anderson as director
?film wdt:P161 ?actor.   # Actor in film
?film wdt:P2047. #film duration
OPTIONAL { ?film p:P161 ?castStatement.
?castStatement ps:P161 ?actor;
pq:P453 ?character. }
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
query <- '
SELECT ?filmLabel ?actorLabel ?duration WHERE {
?film wdt:P57 wd:Q223687.  # Wes Anderson as director
?film wdt:P161 ?actor.   # Actor in film
?duration wdt:P2047. #film duration
OPTIONAL { ?film p:P161 ?castStatement.
?castStatement ps:P161 ?actor;
pq:P453 ?character. }
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
query <- '
SELECT ?filmLabel ?actorLabel ?durationLabel WHERE {
?film wdt:P57 wd:Q223687.  # Wes Anderson as director
?film wdt:P161 ?actor.   # Actor in film
?film wdt:P2047. #film duration
OPTIONAL { ?film p:P161 ?castStatement.
?castStatement ps:P161 ?actor;
pq:P453 ?character. }
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
query <- '
SELECT ?filmLabel ?actorLabel ?characterLabel ?releaseDate ?duration WHERE {
?film wdt:P57 wd:Q223687.         # Directed by Wes Anderson
?film wdt:P161 ?actor.            # Actor in film
OPTIONAL {
?film p:P161 ?castStatement.
?castStatement ps:P161 ?actor;
pq:P453 ?character.  # Character played
}
OPTIONAL { ?film wdt:P577 ?releaseDate. }  # Publication date
OPTIONAL { ?film wdt:P2047 ?duration. }     # Duration (in seconds)
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
results
query <- '
SELECT ?filmLabel ?actorLabel ?releaseDate ?duration WHERE {
?film wdt:P57 wd:Q223687.         # Directed by Wes Anderson
?film wdt:P161 ?actor.            # Actor in film
OPTIONAL {
?film p:P161 ?castStatement.
?castStatement ps:P161 ?actor;
}
OPTIONAL { ?film wdt:P577 ?releaseDate. }  # Publication date
OPTIONAL { ?film wdt:P2047 ?duration. }     # Duration (in seconds)
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
View(results)
query <- '
SELECT ?filmLabel ?actorLabel ?releaseDate ?duration ?boxOffice WHERE {
?film wdt:P57 wd:Q223687.         # Directed by Wes Anderson
?film wdt:P161 ?actor.            # Actor in film
OPTIONAL { ?film wdt:P577 ?releaseDate. }  # Release date
OPTIONAL { ?film wdt:P2047 ?duration. }     # Duration (in seconds)
OPTIONAL {
?film p:P2142 ?boxOfficeStatement.
?boxOfficeStatement ps:P2142 ?boxOffice;
pq:P3005 wd:Q58416391.  # Valid in place: worldwide
}
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
results
View(results)
query <- '
SELECT ?filmLabel ?actorLabel ?releaseDate ?duration ?boxOffice WHERE {
?film wdt:P57 wd:Q223687.         # Directed by Wes Anderson
?film wdt:P161 ?actor.            # Actor in film
OPTIONAL { ?film wdt:P577 ?releaseDate. }  # Release date
OPTIONAL { ?film wdt:P2047 ?duration. }     # Duration (in seconds)
OPTIONAL {
?film p:P2142 ?boxOfficeStatement.
?boxOfficeStatement ps:P2142 ?boxOffice;
pq:P3005 wd:Q13780930.  # Valid in place: worldwide
}
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
View(results)
results
clean_results <- results |>
mutate(releaseDate = ymd(releaseDate))
clean_results
clean_results <- results |>
mutate(releaseDate = ymd(releaseDate)) |>
mutate(actorLabel = case_when(actorLabel == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actorLabel)) |>
group_by(filmLabel, actorLabel) |>
arrange(releaseDate) |>
filter(max(releaseDate))
clean_results <- results |>
mutate(releaseDate = ymd(releaseDate)) |>
mutate(actorLabel = case_when(actorLabel == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actorLabel)) |>
group_by(filmLabel, actorLabel) |>
arrange(releaseDate) |>
filter(max(releaseDate))
clean_results <- results |>
mutate(releaseDate = ymd(releaseDate)) |>
mutate(actorLabel = case_when(actorLabel == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actorLabel)) |>
group_by(filmLabel, actorLabel) |>
arrange(releaseDate) |>
slice_min(releaseDate)
clean_results <- results |>
mutate(releaseDate = ymd(releaseDate)) |>
mutate(actorLabel = case_when(actorLabel == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actorLabel)) |>
group_by(filmLabel, actorLabel) |>
arrange(releaseDate) |>
slice_min(releaseDate) |>
filter(filmLabel %in% c("Castello Cavalcanti", "Cousin Ben Troop Screening with Jason Schwartzman"))
View(clean_results)
clean_results <- results |>
mutate(releaseDate = ymd(releaseDate)) |>
mutate(actorLabel = case_when(actorLabel == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actorLabel)) |>
group_by(filmLabel, actorLabel) |>
arrange(releaseDate) |>
slice_min(releaseDate) |>
filter(!filmLabel %in% c("Castello Cavalcanti", "Cousin Ben Troop Screening with Jason Schwartzman"))
View(clean_results)
query <- '
SELECT ?filmLabel ?actorLabel ?releaseDate ?duration ?boxOffice WHERE {
?film wdt:P57 wd:Q223687.         # Directed by Wes Anderson
?film wdt:P161 ?actor.            # Actor in film
OPTIONAL { ?film wdt:P577 ?releaseDate. }  # Release date
OPTIONAL { ?film wdt:P2047 ?duration. }     # Duration (in seconds)
OPTIONAL {
?film p:P2142 ?boxOfficeStatement.
?boxOfficeStatement ps:P2142 ?boxOffice;
pq:P3005 wd:Q13780930.  # Valid in place: worldwide
}
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
mutate(releaseDate = ymd(releaseDate))
results <- query_wikidata(query)
clean_results <- results |>
mutate(releaseDate = ymd(releaseDate)) |>
mutate(actorLabel = case_when(actorLabel == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actorLabel)) |>
group_by(filmLabel, actorLabel) |>
arrange(releaseDate) |>
slice_min(releaseDate) |>
filter(!filmLabel %in% c("Castello Cavalcanti", "Cousin Ben Troop Screening with Jason Schwartzman"))
View(clean_results)
query <- '
SELECT ?filmLabel ?actorLabel ?releaseDate ?duration ?boxOffice WHERE {
?film wdt:P57 wd:Q223687.         # Directed by Wes Anderson
?film wdt:P161 ?actor.            # Actor in film
OPTIONAL { ?film wdt:P577 ?releaseDate. }  # Release date
OPTIONAL { ?film wdt:P2047 ?duration. }     # Duration (in seconds)
OPTIONAL {
?film p:P2142 ?boxOfficeStatement.
?boxOfficeStatement ps:P2142 ?boxOffice;
pq:P3005 wd:Q13780930.  # Valid in place: worldwide
}
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
View(results)
clean_results
clean_results <- results |>
mutate(releaseDate = ymd(releaseDate)) |>
mutate(actorLabel = case_when(actorLabel == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actorLabel)) |>
group_by(filmLabel, actorLabel) |>
arrange(releaseDate) |>
slice_min(releaseDate) |>
filter(!filmLabel %in% c("Castello Cavalcanti", "Cousin Ben Troop Screening with Jason Schwartzman")) |>
filter(duration == "13")
View(clean_results)
clean_results <- results |>
mutate(releaseDate = ymd(releaseDate)) |>
mutate(actorLabel = case_when(actorLabel == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actorLabel)) |>
group_by(filmLabel, actorLabel) |>
arrange(releaseDate) |>
slice_min(releaseDate) |>
filter(!filmLabel %in% c("Castello Cavalcanti", "Cousin Ben Troop Screening with Jason Schwartzman")) |>
filter(duration != "13")
View(clean_results)
clean_results <- results |>
mutate(releaseDate = ymd(releaseDate)) |>
mutate(actorLabel = case_when(actorLabel == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actorLabel)) |>
group_by(filmLabel, actorLabel) |>
arrange(releaseDate) |>
slice_min(releaseDate) |>
filter(!filmLabel %in% c("Castello Cavalcanti", "Cousin Ben Troop Screening with Jason Schwartzman")) |>
filter(duration != "13") |> # filters out short film versions of bottle rocket
mutate(duration_period = seconds_to_period(as.numeric(duration)))
View(clean_results)
clean_results <- results |>
mutate(releaseDate = ymd(releaseDate)) |>
mutate(actorLabel = case_when(actorLabel == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actorLabel)) |>
group_by(filmLabel, actorLabel) |>
arrange(releaseDate) |>
slice_min(releaseDate) |>
filter(!filmLabel %in% c("Castello Cavalcanti", "Cousin Ben Troop Screening with Jason Schwartzman")) |>
filter(duration != "13") |> # filters out short film versions of bottle rocket
mutate(duration_seconds = as.numeric(duration) * 60,
duration_period = seconds_to_period(duration_seconds)
)
View(clean_results)
library(janitor)
clean_results <- results |>
mutate(releaseDate = ymd(releaseDate)) |>
mutate(actorLabel = case_when(actorLabel == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actorLabel)) |>
group_by(filmLabel, actorLabel) |>
arrange(releaseDate) |>
slice_min(releaseDate) |>
filter(!filmLabel %in% c("Castello Cavalcanti", "Cousin Ben Troop Screening with Jason Schwartzman")) |>
filter(duration != "13") |> # filters out short film versions of bottle rocket
mutate(duration_seconds = as.numeric(duration) * 60,
duration_period = seconds_to_period(duration_seconds)
) |>
clean_names()
View(clean_results)
clean_results <- results |>
clean_names()
query <- '
SELECT ?film ?actor ?releaseDate ?duration ?boxOffice WHERE {
?film wdt:P57 wd:Q223687.         # Directed by Wes Anderson
?film wdt:P161 ?actor.            # Actor in film
OPTIONAL { ?film wdt:P577 ?releaseDate. }  # Release date
OPTIONAL { ?film wdt:P2047 ?duration. }     # Duration (in seconds)
OPTIONAL {
?film p:P2142 ?boxOfficeStatement.
?boxOfficeStatement ps:P2142 ?boxOffice;
pq:P3005 wd:Q13780930.  # Valid in place: worldwide
}
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
results
query <- '
SELECT ?film ?actor ?release_date ?duration ?box_office WHERE {
?film wdt:P57 wd:Q223687.         # Directed by Wes Anderson
?film wdt:P161 ?actor.            # Actor in film
OPTIONAL { ?film wdt:P577 ?release_date. }  # Release date
OPTIONAL { ?film wdt:P2047 ?duration. }     # Duration (in seconds)
OPTIONAL {
?film p:P2142 ?boxOfficeStatement.
?boxOfficeStatement ps:P2142 ?box_office;
pq:P3005 wd:Q13780930.  # Valid in place: worldwide
}
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
View(results)
query <- '
SELECT ?filmLabel ?actorLabel ?releaseDate ?duration ?boxOffice WHERE {
?film wdt:P57 wd:Q223687.         # Directed by Wes Anderson
?film wdt:P161 ?actor.            # Actor in film
OPTIONAL { ?film wdt:P577 ?releaseDate. }  # Release date
OPTIONAL { ?film wdt:P2047 ?duration. }     # Duration (in seconds)
OPTIONAL {
?film p:P2142 ?boxOfficeStatement.
?boxOfficeStatement ps:P2142 ?boxOffice;
pq:P3005 wd:Q13780930.  # Valid in place: worldwide
}
SERVICE wikibase:label { bd:serviceParam wikibase:language "[AUTO_LANGUAGE],en". }
}'
results <- query_wikidata(query)
View(results)
clean_results <- results |>
clean_names()
clean_results <- results |>
clean_names()
mutate(release_date = ymd(release_date)) |>
mutate(actor_label = case_when(actor_label == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actor_label)) |>
group_by(film_label, actor_label) |>
arrange(release_date)
clean_results <- results |>
clean_names()
mutate(release_date = ymd(release_date)) |>
mutate(actor_label = case_when(actor_label == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actor_label)) |>
group_by(film_label, actor_label) |>
arrange(release_date) |>
slice_min(release_date)
clean_results <- results |>
clean_names() |>
mutate(release_date = ymd(release_date)) |>
mutate(actor_label = case_when(actor_label == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actor_label)) |>
group_by(film_label, actor_label) |>
arrange(release_date) |>
slice_min(release_date)
clean_results <- results |>
clean_names() |>
mutate(release_date = ymd(release_date)) |>
mutate(actor_label = case_when(actor_label == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actor_label)) |>
group_by(film_label, actor_label) |>
arrange(release_date) |>
slice_min(release_date)
select(-duration, duration_secoonds)
clean_results <- results |>
clean_names() |>
filter(!filmLabel %in% c("Castello Cavalcanti", "Cousin Ben Troop Screening with Jason Schwartzman", "Hotel Chevalier")) |> ##removing shorts / promos
filter(duration != "13") |> # filters out short film versions of bottle rocket
mutate(release_date = ymd(release_date)) |>
mutate(actor_label = case_when(actor_label == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actor_label)) |>
group_by(film_label, actor_label) |>
arrange(release_date) |>
slice_min(release_date) |>
mutate(duration_seconds = as.numeric(duration) * 60,
duration_period = seconds_to_period(duration_seconds)
) |>
select(-duration, duration_secoonds)
clean_results <- results |>
clean_names() |>
filter(!film_label %in% c("Castello Cavalcanti", "Cousin Ben Troop Screening with Jason Schwartzman", "Hotel Chevalier")) |> ##removing shorts / promos
filter(duration != "13") |> # filters out short film versions of bottle rocket
mutate(release_date = ymd(release_date)) |>
mutate(actor_label = case_when(actor_label == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actor_label)) |>
group_by(film_label, actor_label) |>
arrange(release_date) |>
slice_min(release_date) |>
mutate(duration_seconds = as.numeric(duration) * 60,
duration_period = seconds_to_period(duration_seconds)
) |>
select(-duration, duration_secoonds)
clean_results <- results |>
clean_names() |>
filter(!film_label %in% c("Castello Cavalcanti", "Cousin Ben Troop Screening with Jason Schwartzman", "Hotel Chevalier")) |> ##removing shorts / promos
filter(duration != "13") |> # filters out short film versions of bottle rocket
mutate(release_date = ymd(release_date)) |>
mutate(actor_label = case_when(actor_label == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actor_label)) |>
group_by(film_label, actor_label) |>
arrange(release_date) |>
slice_min(release_date) |>
mutate(duration_seconds = as.numeric(duration) * 60,
duration_period = seconds_to_period(duration_seconds)
) |>
select(-duration, duration_seconds)
View(clean_results)
clean_results <- results |>
clean_names() |>
filter(!film_label %in% c("Castello Cavalcanti", "Cousin Ben Troop Screening with Jason Schwartzman", "Hotel Chevalier")) |> ##removing shorts / promos
filter(duration != "13") |> # filters out short film versions of bottle rocket
mutate(release_date = ymd(release_date)) |>
mutate(actor_label = case_when(actor_label == "Q1333118" ~ "Richard Ayoade",
TRUE ~ actor_label)) |>
group_by(film_label, actor_label) |>
arrange(release_date) |>
slice_min(release_date) |>
mutate(duration_seconds = as.numeric(duration) * 60,
duration_period = seconds_to_period(duration_seconds)
) |>
select(-duration, -duration_seconds)
View(clean_results)
